app/views/details_purchase_orders/_form.html.erb

SELECT "info_purchase_orders"."id" FROM "info_purchase_orders"
---
    <%= form.label :info_purchase_order_id %>
    <%= form.select :info_purchase_order_id, InfoPurchaseOrder.all.pluck(:id) %>

SELECT "products"."name", "products"."id" FROM "products"
---
    <%= form.label :product_id %>
    <%= form.select :product_id, Product.all.pluck(:name, :id) %>