app/views/details_dispatch_orders/_form.html.erb

SELECT "info_dispatch_orders"."id" FROM "info_dispatch_orders"
---
    <%= form.label :info_dispatch_order_id %>
    <%= form.select :info_dispatch_order_id, InfoDispatchOrder.all.pluck(:id) %>

SELECT "products"."name", "products"."id" FROM "products"
---
    <%= form.label :product_id %>
    <%= form.select :product_id, Product.all.pluck(:name, :id) %>