app/views/dispatches/_form.html.erb

    <%= form.label :details_dispatch_orders_id %>
    <%= form.select :info_dispatch_orders_id, InfoDispatchOrder.all.pluck(:id), {prompt: "Seleccione Orden"}, id: "dispatch_order" %>
---
SELECT "info_dispatch_orders"."id" FROM "info_dispatch_orders"

    <%= form.label :details_dispatch_orders %>
    <%= form.select :details_dispatch_orders, DetailsDispatchOrder.includes(:product).all.pluck(:name, :id), {}, id: "product_details" %>
---
SELECT "name", "details_dispatch_orders"."id" FROM "details_dispatch_orders" LEFT OUTER JOIN "products" ON "products"."id" = "details_dispatch_orders"."product_id"