app/views/receptions/_form.html.erb

    <%= form.label :Nº_Orden_de_Compra %>
    <%= form.select :info_purchase_orders_id, InfoPurchaseOrder.all.pluck(:id), {prompt: "Seleccione Orden"}, id: "purchase_order" %>
---
SELECT "details_purchase_orders"."id" FROM "details_purchase_orders"
SELECT "info_purchase_orders"."id" FROM "info_purchase_orders"

    <%= form.label :Detalle_Orden_de_Compra%>
    <%= form.select :details_purchase_orders_id, DetailsPurchaseOrder.includes(:product).all.pluck(:name, :id), {}, id: "product_detail" %>
---
SELECT "name", "details_purchase_orders"."id" FROM "details_purchase_orders" LEFT OUTER JOIN "products" ON "products"."id" = "details_purchase_orders"."product_id"
SELECT "products"."name", "products"."id" FROM "products"