app/views/info_purchase_orders/_form.html.erb

      <%= form.label :provider_id %><br>
      <%= form.select :provider_id, Provider.all.pluck(:name, :id) %>
---
SELECT "providers"."name", "providers"."id" FROM "providers"

      <%= form.label :user_id %><br>
      <%= form.select :user_id, User.all.pluck(:email, :id) %>
---
SELECT "users"."email", "users"."id" FROM "users"