app/views/info_dispatch_orders/_form.html.erb

      <%= form.label :client_id %><br>
      <%= form.select :client_id, Client.all.pluck(:name, :id) %>
---
SELECT "clients"."name", "clients"."id" FROM "clients"

      <%= form.label :user_id %><br>
      <%= form.select :user_id, User.all.pluck(:email, :id) %>
---
SELECT "users"."email", "users"."id" FROM "users"