app/views/stock_by_locations/_form.html.erb

    <%= form.label :location_id %><br>
    <%= form.select :location_id, Location.all.pluck(:name, :id) %>
---
SELECT "locations"."name", "locations"."id" FROM "locations"

    <%= form.label :product_id %><br>
    <%= form.select :product_id, Product.all.pluck(:name, :id) %>
---
SELECT "products"."name", "products"."id" FROM "products"