app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE (name LIKE '%cliente%')
---
  def index
    @clients = Client.all

INSERT INTO "clients" ("name", "direction", "payment_condition", "phone", "email", "contact", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save

DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 7]]
---
  def destroy
    @client.destroy