app/controllers/details_dispatch_orders_controller.rb

  def index
    @details_dispatch_orders = DetailsDispatchOrder.all
---
SELECT "details_dispatch_orders".* FROM "details_dispatch_orders"

  def create
    @details_dispatch_order = DetailsDispatchOrder.new(details_dispatch_order_params)

    respond_to do |format|
      if @details_dispatch_order.save
---
INSERT INTO "details_dispatch_orders" ("info_dispatch_order_id", "product_id", "product_quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["info_dispatch_order_id", 1], ["product_id", 7], ["product_quantity", 44], ["created_at", "2020-03-18 12:54:22.020228"], ["updated_at", "2020-03-18 12:54:22.020228"]]

    def set_details_dispatch_order
      @details_dispatch_order = DetailsDispatchOrder.find(params[:id])
---
SELECT  "info_dispatch_orders".* FROM "info_dispatch_orders" WHERE "info_dispatch_orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "details_dispatch_orders".* FROM "details_dispatch_orders" WHERE "details_dispatch_orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]