app/controllers/details_purchase_orders_controller.rb

SELECT "details_purchase_orders".* FROM "details_purchase_orders"
---
  def index
    @details_purchase_orders = DetailsPurchaseOrder.all

INSERT INTO "details_purchase_orders" ("info_purchase_order_id", "product_id", "product_quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["info_purchase_order_id", 1], ["product_id", 7], ["product_quantity", 664], ["created_at", "2020-03-18 13:08:48.670162"], ["updated_at", "2020-03-18 13:08:48.670162"]]
---
  def create
    @details_purchase_order = DetailsPurchaseOrder.new(details_purchase_order_params)

    respond_to do |format|
      if @details_purchase_order.save

UPDATE "details_purchase_orders" SET "info_purchase_order_id" = $1, "updated_at" = $2 WHERE "details_purchase_orders"."id" = $3  [["info_purchase_order_id", 4], ["updated_at", "2020-03-18 17:08:55.163556"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @details_purchase_order.update(details_purchase_order_params)

SELECT  "info_purchase_orders".* FROM "info_purchase_orders" WHERE "info_purchase_orders"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "details_purchase_orders".* FROM "details_purchase_orders" WHERE "details_purchase_orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_details_purchase_order
      @details_purchase_order = DetailsPurchaseOrder.find(params[:id])