app/controllers/dispatches_controller.rb

  def index
    @dispatches = Dispatch.all
---
SELECT "dispatches".* FROM "dispatches"

  def show
    @dispatch = Dispatch.find(params[:id])
---
SELECT  "dispatches".* FROM "dispatches" WHERE "dispatches"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]