app/controllers/events_controller.rb

INSERT INTO "events" ("title", "start", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Recepcion Proveedor Konami"], ["start", "2020-03-20 12:00:00"], ["created_at", "2020-03-19 12:35:49.506553"], ["updated_at", "2020-03-19 12:35:49.506553"]]
---
  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "start" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["start", "2020-03-20 13:00:00"], ["updated_at", "2020-03-19 12:39:17.571676"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @event.update(event_params)