app/controllers/info_dispatch_orders_controller.rb

SELECT "info_dispatch_orders".* FROM "info_dispatch_orders"
---
  def index
    @info_dispatch_orders = InfoDispatchOrder.search(params[:search])

INSERT INTO "info_dispatch_orders" ("client_id", "client_order_purchase", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["client_id", 5], ["client_order_purchase", "513213123"], ["user_id", 2], ["created_at", "2020-03-18 12:31:18.663388"], ["updated_at", "2020-03-18 12:31:18.663388"]]
---
  def create
    @info_dispatch_order = InfoDispatchOrder.new(info_dispatch_order_params)

    respond_to do |format|
      if @info_dispatch_order.save

SELECT  "info_dispatch_orders".* FROM "info_dispatch_orders" WHERE "info_dispatch_orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_info_dispatch_order
      @info_dispatch_order = InfoDispatchOrder.find(params[:id])