app/controllers/info_purchase_orders_controller.rb

SELECT "info_purchase_orders".* FROM "info_purchase_orders" WHERE (provider LIKE '%KONAMI%')
---
  def index
    @info_purchase_orders = InfoPurchaseOrder.all

INSERT INTO "info_purchase_orders" ("provider_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["provider_id", 4], ["user_id", 2], ["created_at", "2020-03-18 13:02:56.387173"], ["updated_at", "2020-03-18 13:02:56.387173"]]
---
  def create
    @info_purchase_order = InfoPurchaseOrder.new(info_purchase_order_params)

    respond_to do |format|
      if @info_purchase_order.save

SELECT  "info_purchase_orders".* FROM "info_purchase_orders" WHERE "info_purchase_orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_info_purchase_order
      @info_purchase_order = InfoPurchaseOrder.find(params[:id])