app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT "locations".* FROM "locations" WHERE (name LIKE '%01%')

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("name", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Cuarentena"], ["category", "No Disponible"], ["created_at", "2020-03-02 18:03:22.605278"], ["updated_at", "2020-03-02 18:03:22.605278"]]

  def destroy
    @location.destroy
---
DELETE FROM "locations" WHERE "locations"."id" = $1  [["id", 2]]