app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%deck%')
---
  def index
    @products = Product.all

SELECT  "stock_by_locations".* FROM "stock_by_locations" WHERE "stock_by_locations"."product_id" = $1 LIMIT $2  [["product_id", 3], ["LIMIT", 1]]
---
  def show
    @stock_by_location = StockByLocation.all

INSERT INTO "products" ("sku", "name", "ean", "category", "subcategory", "active", "created_at", "updated_at", "provider_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "provider_id" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["provider_id", 1], ["updated_at", "2020-03-16 15:55:22.776690"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)