app/controllers/providers_controller.rb

SELECT "providers".* FROM "providers" WHERE (name LIKE '%KONAMI%')
---
  def index
    @providers = Provider.all

INSERT INTO "providers" ("name", "direction", "payment_condition", "phone", "email", "contact", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @provider = Provider.new(provider_params)

    respond_to do |format|
      if @provider.save

DELETE FROM "providers" WHERE "providers"."id" = $1  [["id", 3]]
---
  def destroy
    @provider.destroy

SELECT  "providers".* FROM "providers" WHERE "providers"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_provider
      @provider = Provider.find(params[:id])