app/controllers/receptions_controller.rb

SELECT "receptions".* FROM "receptions" WHERE (name LIKE '%deck%')
SELECT "details_purchase_orders".* FROM "details_purchase_orders"
---
  def index
    @receptions = Reception.all
    @details_purchase_orders = DetailsPurchaseOrder.all

SELECT  "receptions".* FROM "receptions" WHERE "receptions"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @reception = Reception.find(params[:id])