app/controllers/search_od_controller.rb

SELECT "details_dispatch_orders".* FROM "details_dispatch_orders" WHERE "details_dispatch_orders"."info_dispatch_order_id" = $1  [["info_dispatch_order_id", 1]]
---
  def index
    @dispatch_order_details = DetailsDispatchOrder.where(info_dispatch_order_id: params[:id])