app/controllers/search_details_controller.rb

  def index
    @purchase_order_details = DetailsPurchaseOrder.where(info_purchase_order_id: params[:id])
---
SELECT "details_purchase_orders".* FROM "details_purchase_orders" WHERE "details_purchase_orders"."info_purchase_order_id" = $1  [["info_purchase_order_id", 4]]