app/controllers/stock_by_locations_controller.rb

  def index
    @stock_by_locations = StockByLocation.all
---
SELECT "stock_by_locations".* FROM "stock_by_locations" WHERE (location_id.name LIKE '%Cua%')

  def create
    @stock_by_location = StockByLocation.new(stock_by_location_params)

    respond_to do |format|
      if @stock_by_location.save
---
INSERT INTO "stock_by_locations" ("location_id", "product_id", "product_quantity", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["location_id", 1], ["product_id", 5], ["product_quantity", 222], ["created_at", "2020-03-09 16:08:44.618577"], ["updated_at", "2020-03-09 16:08:44.618577"]]

  def update
    respond_to do |format|
      if @stock_by_location.update(stock_by_location_params)
---
UPDATE "stock_by_locations" SET "location_id" = $1, "updated_at" = $2 WHERE "stock_by_locations"."id" = $3  [["location_id", 1], ["updated_at", "2020-03-09 15:51:46.619918"], ["id", 8]]

  def destroy
    @stock_by_location.destroy
---
DELETE FROM "products_stock_by_locations" WHERE "products_stock_by_locations"."stock_by_location_id" = $1  [["stock_by_location_id", 4]]
DELETE FROM "stock_by_locations" WHERE "stock_by_locations"."id" = $1  [["id", 8]]

    def set_stock_by_location
      @stock_by_location = StockByLocation.find(params[:id])
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "stock_by_locations".* FROM "stock_by_locations" WHERE "stock_by_locations"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]