app/models/reception.rb

    def self.search(search)
---
SELECT "receptions".* FROM "receptions"