app/views/products/_form.html.erb

      <%= form.label :Proveedor %><br>
      <%= form.select :provider_id, Provider.all.pluck(:name, :id) %>
---
SELECT "providers"."name", "providers"."id" FROM "providers"